<?php

namespace Database\Seeders;

use App\Models\Day;
use App\Models\DayExercise;
use App\Models\Exercise;
use App\Models\ExerciseType;
use Faker\Factory;
use Illuminate\Database\Seeder;

class DaySeeder extends Seeder
{
    public function run()
    {
        for ($day_number = 1; $day_number <= 21; $day_number++) {
            $day = Day::query()
                ->updateOrCreate([
                    'number' => $day_number,
                ], [
                    'title' => $this->getDayTitle($day_number),
                    'phrase' => $this->getDayPhrase($day_number),
                ]);
            $lessons_array = $this->getLessons($day_number);
            foreach ($lessons_array as $key => $lesson_item) {
                $day->lessons()
                    ->create([
                        'description' => $lesson_item,
                        'sort' => $key + 1,
                    ]);
            }
            $this->seedExercise($day_number);
        }
    }

    private function getDayTitle($number)
    {
        if ($number == 1) {
            return 'روز یکم';
        } elseif ($number == 2) {
            return 'روز دوم';
        } elseif ($number == 3) {
            return 'روز سوم';
        } elseif ($number == 4) {
            return 'روز چهارم';
        } elseif ($number == 5) {
            return 'روز پنجم';
        } elseif ($number == 6) {
            return 'روز ششم';
        } elseif ($number == 7) {
            return 'روز هفتم';
        } elseif ($number == 8) {
            return 'روز هشتم';
        } elseif ($number == 9) {
            return 'روز نهم';
        } elseif ($number == 10) {
            return 'روز دهم';
        } elseif ($number == 11) {
            return 'روز یازدهم';
        } elseif ($number == 12) {
            return 'روز دوازدهم';
        } elseif ($number == 13) {
            return 'روز سیزدهم';
        } elseif ($number == 14) {
            return 'روز چهاردهم';
        } elseif ($number == 15) {
            return 'روز پانزدهم';
        } elseif ($number == 16) {
            return 'روز شانزدهم';
        } elseif ($number == 17) {
            return 'روز هفدهم';
        } elseif ($number == 18) {
            return 'روز هجدهم';
        } elseif ($number == 19) {
            return 'روز نوزدهم';
        } elseif ($number == 20) {
            return 'روز بیستم';
        } elseif ($number == 21) {
            return 'روز بیست و یکم';
        }
    }

    private function getDayPhrase($number)
    {
        if ($number == 1) {
            return 'مسیری که میخوای شروع کنی، نیازمند صبر و استمراره…';
        } elseif ($number == 2) {
            return 'مراقب باش متنفر نشی';
        } elseif ($number == 3) {
            return 'گره زدن عادت  ها';
        } elseif ($number == 4) {
            return 'تنظیم خواب';
        } elseif ($number == 5) {
            return 'قانون 2 دقیقه ای برای ایجاد عادات ماندگار';
        } elseif ($number == 6) {
            return 'قطعیت رو وارد مسیر عادتت کن';
        } elseif ($number == 7) {
            return 'گره زدن عادت به رفتار مورد علاقه';
        } elseif ($number == 8) {
            return 'قربانی محیط نباش، ازش استفاده کن';
        } elseif ($number == 9) {
            return 'کمترین تلاش رو بذار!';
        } elseif ($number == 10) {
            return 'آپشن های زیادی رو حذف کن';
        } elseif ($number == 11) {
            return 'ایجاد کارت عادت';
        } elseif ($number == 12) {
            return 'به همه بگو کی هستی...';
        } elseif ($number == 13) {
            return 'کنار گذاشتن خویشتن داری!';
        } elseif ($number == 14) {
            return 'نقش جامعه و خونواده';
        } elseif ($number == 15) {
            return 'یکی از قویترین حقه های ذهنمون';
        } elseif ($number == 16) {
            return 'تفاوت حرکت (جنبش) و اقدام';
        } elseif ($number == 17) {
            return 'چگونه پاداشی رو به وجود بیاریم که باعث بشه عاداتمون رضایت بخش باشه';
        } elseif ($number == 18) {
            return 'چگونگی خودکار کردن عادات خوب';
        } elseif ($number == 19) {
            return 'رفتار دومینویی عادت ها';
        } elseif ($number == 20) {
            return 'ایجاد تنوع و تغییر';
        } elseif ($number == 21) {
            return 'قانون طلایی عادت ها';
        }
    }

    private function getLessons($number)
    {
        if ($number == 1) {
            return [
                'تغییرات توی زندگی خیلی آروم اتفاق میفتن و همین باعث میشه متوجه نتایج عادت های بدمون نباشیم، مثلا عادات غذایی بد همین امروز باعث چاقی نمیشن ولی چند ماه بعد به جز چاقی، سلامت جسم و روح ما رو هم به خطر میندازن.',
                'شاید فکر کنی انتخابی که یک درصد بهتر یا بدتر از وضعیت فعلیه نمی تونه مقصدت رو عوض کنه اما تغییر، نتیجه ی همین قدم های کوچیک توی عادات روزانه ماست نه تحولات یهویی.',
                'فرض کن یه تیکه یخ رو گذاشتی توی یه اتاق با دمای ۴- درجه، شروع به بالا بردن دما می کنی ۳-، ۲-، هیچی نمیشه، ۱-،صفر و ۱ حالا اتفاق میفته یخ ذوب میشه فقط و فقط با یه درجه دیگه تغییر.',
                'ما انتظار داریم با هر قدم حداقل بخشی از نتیجه رو ببینیم وگرنه ناامید میشیم و فکر میکنیم هیچوقت نتیجه نمیده در صورتی که نتایج بزرگ و قوی با تاخیر زیاد ظاهر میشن',
                'یه مثال دیگه واسه لمس بهتر موضوع صفحات زمینن که چندین سال بهم فشار میارن تا زمانی که زلزله رخ بده و هر چقدر این زمان بیشتر باشه بزرگی زلزله هم بیشتره.',
                'slide image',
                'از همین روز اول که پا توی مسیر گذاشتی باید به همه ی لحظات ناامیدکننده و همینطور نتایج امیدبخش مسیرت فکر کنی و با آگاهی جلو بری، وقتی درگیر دره ی ناامیدی شدی بدون تلاشت هدر نرفته فقط ذخیره شده و به زودی میبینیش.',
                'اما توی تکالیف امروز ازت می‌خوایم پیش نیاز ها رو در نظر بگیری! مثلا اگه انتخاب کردی که از ورزش یه عادت بســازی، قبلش لازم داری مطمئن بشــی توی طول روز مواد غذایی به اندازه کافی مصـرف میکنی و انرژیت قرار نیسـت ته بکشـه! ',
                'علاوه بر اهمیت شــناســایی پیش نیاز های عادتت و برآورده کردن اونها، لازم داری بدونی اگر قرار هسـت عادتی رو ایجاد کنی، باید شـخصـیت و هویتی رو توی خودت ببینی که اون عادت رو داره! در نتیجه توی بخش دوم تکالیف امروز از می‌خوایم خصوصیاتی رو بنویسی که توی شخصیت الگوت اونها رو می‌بینی.',
            ];
        } elseif ($number == 2) {
            return [
                'ابتدای مسیر انگیزه ما خیلی بالاست و متوجه نیستیم ذهنمون در آینده میتونه ما رو از اجرای عادت جدید منصرف کنه باید در طول اجرای عادت دقت کنیم از کدوم مراحل خوشمون نمیاد.',
                'امروز بعد از اجرای عادت جدیدت خوب فکر کن چه چیزایی ممکنه تو رو از اون عادت متنفر کنه و حتما بعد از انجامش این موارد رو توی پلنر یادداشت کن.',
                'مثال: اگه عادت جدید باشگاه رفتن باشه بهتره انجام تمریناتی که شدتشون بالاست و باعث خستگی زیادی میشن رو بذاری برای بعد از شکل گرفتن عادتت.',
                'اگه عادت جدید کتاب خوندن باشه خوندن یه کتاب فلسفی و سنگین برای شروع تو رو از پروسه متنفر میکنه.',
                'انجام عادت جدید برای مدت زمان طولانی طی روز و انتظار بی نقص انجام دادنش همون اول کار باعث دلزدگیمون میشه.',
                'و در نهایت قدم مهم امروز… همین اول مسیر، توی بخش تکالیف امروز کارایی که از پروسه متنفرت میکنن رو شناسایی کن و بذارشون کنار.',
            ];
        } elseif ($number == 3) {
            return [
                'امروز میخوایم یه کار خیلی جذاب بکنیم عادتمون رو به یه اتفاق خاص در آینده گره بزنیم. به بازی های موفق نگاه کنین همشون بر پایه پاداش پیش میرن…',
                'اگه پاداش نباشه کسی سعی نمیکنه تمومشون کنه امروز تو هم قراره یه پاداش جذاب برای بعد از نتیجه گرفتن از پروسه تشکیل عادتت انتخاب کنی.',
                'من میخوام بعد از نتیجه گرفتن از عادت ورزشم عکس بدن جذابم رو بذارم پروفایلم یا تتویی که دوست دارم رو بزنم.',
                'من وقتی کتاب خوندن واسم عادت شد برای خودم یه کتابخونه با کلی کتاب داخلش بسازم.',
                'یا وقتی تمرین برنامه نویسی عادتم شد دوره های جدید رو شرکت کنم و مدرکشونو بزنم به دیوار اتاقم.',
                'همه ی این اتفاقات جذاب با ایجاد عادات درست دور از دسترس نیستن.',
                'اما یه درس مهم دیگه که قراره امروز یاد بگیریم اینه که فرق سیستم با هدف چیه؟
اهداف نوعی دو راهی این یا اون ایجاد میکنن یعنی یا به هدفت میرسی یا شکست میخوری با اینکار ذهنت رو توی یه نسخه ی محدود از رضایت قرار میدی، این اشتباهه',
                'احتمال یکی بودن مسیر واقعی زندگی با مسیری که توی ذهنت ترسیم کردی خیلی کمه.',
                'طرز فکر سیستمی یعنی به جای مقصد عاشق مسیر باشی لزومی نداره منتظر نتیجه باشی تا خوشحال بشی، یه سیستم میتونه در فرم های متفاوتی موفق باشه نه فقط یک چشم انداز.',
                'اگه با تغییر عاداتت مشکل داری مشکل خودت نیستی سیستمه، عادت های بد خودشون رو تکرار میکنن نه برای اینکه نمیخوای تغییرشون بدی، چون مسیر غلطی رو برای تغییرشون انتخاب کردی.',
                'و در نهایت توی بخش تکالیف امروز؛ ازت می‌خوایم فانتزی های عادت جدیدت رو بنویسی.',
            ];
        } elseif ($number == 4) {
            return [
                'امروز قراره روی مسئله ای تمرکز کنیم که اگه بخوایم عادتی توی زندگیمون ثابت بشه باید حتما روش کار کنیم و اون چیزی نیست جز برنامه خواب منظم. لازمه از همین امروز شروع کنی اوایل یه مقدار سخته اما به مرور متوجه تاثیرش توی سبک زندگیت میشی.',
                'از نظر پزشک ها حداقل 7ساعت خواب توی روتین روزانه باعث بالا موندن سطح انرژی و خلق و خو میشه. و حالا نکاتی که برای تنظیم ساعت خواب مهم هستن:',
                '1. تصمیم بگیر چه ساعتی میخوای از خواب پاشی
موقع تصمیم گیری به اینکه صبح ها چه حال و هوایی داری؟ برای بلند شدن و لباس پوشیدن چه قدر زمان لازم داری؟ و... توجه کن',
                '
2. بهترین مقدار خوابت رو حساب کن
مقدار کافی خواب برای هر کس متفاوته میتونی با ثبت مدت خوابت برای چند هفته ساعت مناسب خواب و بیداریت رو تشخیص بدی. پس با توجه به میزان خوابی که احتیاج داری حساب کن چه ساعتی باید بخوابی که صبح به موقع بیدار بشی
',
                '
3. آروم آروم انجامش بده و عجله نکن
اگه به طور معمول صبح ها ساعت 10 بیدار میشی اما میخوای 5 صبح بیدار بشی بهتره اینکار رو نه یه شبه بلکه با تنظیم بازه های 15 دقیقه ای انجام بدی. یعنی از فردا باید ساعتت رو به جای 10 روی 9:45 دقیقه تنظیم کنی و اینکار رو هر روز با یه ربع عقبتر بردن ساعت ادامه بدی تا به ساعت 5 برسی.',
                '
4. ساعتت رو دقیقا روی زمانی که باید بیدار شی تنظیم کن
به هیچ وجه ساعتت رو برای تکرارهای چند دقیقه ای تنظیم نکن، زود بیدار شدن سخته اما تکرار زنگ ساعت فقط باعث خسته تر شدنت میشه چون توی این زمان های کوتاه خواب عمیقی رو تجربه نمیکنی و برای ذهنت این باور رو به وجود میاری که آدم باثباتی نیستی و قرار نیست سر ساعت از خواب پاشی
',
                '
5. شب قبل صبحت رو بازسازی کن
یکی از کارهای رایج قبل از کنکور (با توجه به عجیب و غریب بودن حجم استرس و تخریب کنندگی این پدیده) رفتن به محل برگزاری برای آشنایی با مسیر و کم شدن استرسه.
',
                'وقتی صبح ها ساعت متفاوتی رو برای بیدار شدن انتخاب کنی ذهنت این اتفاق رو خطر ارزیابی میکنه و باهاش میجنگه، می تونی برای کمک بهش شب قبل کارایی که قراره صبح انجام بدی بازسازی کنی. مثلا قبل از خواب گوشیت رو بردار، زنگش رو خاموش کن، تا کنار پنجره برو، یه لیوان آب بخور و...',
                'در نتیجه ازت می‌خوایم برای تکالیف امروز، یه ساعت مشخص برای خوابت انتخاب کنی و اقداماتی که لازمه برای به نتیجه رسیدنِ این انتخاب انجام بشن رو لیست کنی.',
            ];
        } elseif ($number == 5) {
            return [
                'قبل از اینکه عادت کاملا شکل بگیره بر خلاف ابتدای مسیر که انجام کارهای بزرگ آسونه در طول مسیر دچار افت انگیزه برای اقدام و تکرار رفتار مورد نظر میشیم.',
                'پس لازمه یه نسخه دو دقیقه ای از عادت انتخابیمون برای روزهای سخت داشته باشیم تا با انجامش جلوی متوقف شدن شکلگیری مسیر نورونی جدید توی ذهنمون رو بگیریم.',
                'نسخه دو دقیقه ای باید خیلی ساده و قابل انجام باشه!',
                '
برای مثال؛
10 هزار قدم پیاده روی در روز ؛ به پوشیدن کفش های پیاده روی تبدیل میشه.
تمیز نگه داشتن محیط؛ به انداختن فقط یک لباس کثیف توی ماشین لباسشویی تبدیل میشه.
شریک بهتری بودن؛ به درست کردن یه فنجون قهوه برای همسرم تبدیل میشه.
رژیم سالم خوری؛  به خوردن یک سیب اول صبح تبدیل میشه.',
            ];
        } elseif ($number == 6) {
            return [
                'خیلی از آدما فکر میکنن که انگیزه کافی ندارن اما مشکل واقعی کمبود قطعیته. توی این درس میخوایم یه مکان شفاف و مشخص برای عادت جدیدمون پیدا کنیم تا بتونه اونجا زندگی کنه و زنده بمونه. موثرترین روش برای اینکار قصد اجراست.',
                '
قصد اجرا یعنی مشخص کردن کی و کجا بودن یه کار و به قطعیت رسوندن اون. اگه از یه قصد اجرا استفاده کنی به احتمال زیاد میتونی برنامه هات رو دنبال کنی و عادتت رو رها نکنی. یه راه ساده برای اجرای این راهبرد تکمیل کردن جمله زیر هستش
من در (زمان) و در (مکان)، (رفتار) رو انجام میدم',
                '
به عنوان مثال
من در ساعت 7 صبح و در آشپزخانه، یه اسموتی سبزیجات درست میکنم،
من در ساعت 9 شب و در اتاقم، حرکات کششی انجام میدم،
من در ابتدای وقت ناهار در محل کارم به همسرم پیام میدم و حالش رو میپرسم.',
                '
مرحله مهم انتخاب بهترین زمان و مکان برای وارد کردن عادت جدیدمون در روتین روزانه مون هستش
حواست باشه که قصد اجرا باید شفاف و مشخص باشه
من بعد از اینکه دندون هام رو در توالت مسواک زدم، یه لیوان آب خواهم خورد،
من بعد از اینکه ظهر در اتاق پست نامه هام رو گرفتم، نامه های به درد نخور رو دور خواهم ریخت،
من در ساعت 8:30 صبح در پشت میزم، اولویت های روزم رو درجه بندی خواهم کرد',
                'انتخاب زمان و مکان درست خیلی مهمه اگه میخوای عادت ورزش رو ایجاد کنی انتخاب ساعتی که توش نه انرژی داری نه وقت نادرسته یا انتخاب جایی که مناسب ورزش نیست و حواست رو پرت میکنه مسیر شکلگیری عادتت رو خراب میکنه.',
            ];
        } elseif ($number == 7) {
            return [
                'نمیشه از کاهش انگیزه فرار کرد و ممکنه بارها به دلایل مختلف گیرمون بندازه، نباید برای ساخت سبک زندگی جدیدمون به انگیزه تکیه کنیم چون به محض کاهش انگیزه همه چی از بین میره.',
                'امروز یه روش جذاب برای زمان های کاهش انگیزه بهت معرفی میکنیم؛ گره زدن عادت جدید به یه عادت قدیمی و جذاب.',
                'یعنی برای جذابیت بیشتر عادتی که در حال ساختش هستی رو به کاری پیوند میزنی که دوستش داری. مثلا وقتی داری سریال میبینی همزمان لباس هات رو مرتب میکنی و عادت مرتب نگه داشتن محیطت رو تمرین میکنی. البته برای بعضی ها پیاده سازی این روش سخته.',
                'زمانی که ببینی میتونی بدون مرتب کردن خونه سریالت رو ببینی از بخش باید صرف نظر میکنی و سریعا به بخش خواستن میرسی. ولی با کمک روش گره زدن میتونی خودت رو از بخش خواستن منع کنی و قول بدی فقط در حال مرتب کردن خونه اون برنامه رو تماشا کنی. ',
                '
به عبارت دیگه انجام عادت جدیدت رو شرطی میکنی.
من تنها زمانی (عادتی که میخوام رو انجام میدم) که (در حال انجام عادتی که باید هستم).
من تنها زمانی پازلم رو تکمیل میکنم که دارم کتاب صوتی گوش میدم.
من تنها زمانی خوراکی مورد علاقم رو میخورم که دارم فرانسوی میخونم.
من تنها زمانی کافی شاپ میرم که بخوام روی برنامه ریزی هفته آینده کار کنم.
',
            ];
        } elseif ($number == 8) {
            return [
                'وظیفه امروزمون ساختن سیستم یادآورها و کارکردن روی محیطمونه. یکی از دلایل افت انگیزه در طول مسیر فراموش کردن فانتزی های شروع مسیره و این یکی از حقه های ذهنمونه، ذهن ما دوست داره توی فضای همیشگیش بمونه و از تغییر توی سبک زندگی و ایجاد مسیر نورونی جدید خوشش نمیاد!',
                'چون احساس خطر میکنه و تشخیص میده که داریم به جسممون ضربه میزنیم ( یکی از خطاهای ذهنی رایج) در نتیجه اتفاقات قشنگی که اول کار تصورشون کردیم رو پاک میکنه. مثلا اگه تصور کردی عادت کتاب ذهنت رو آرومتر میکنه و کلی چیزای جدید تجربه میکنی',
                'یا اگه برای عادت ورزش بدن ورزیدت رو تصور کردی به مرور همش پاک میشه و احساس خطر بین تو و اون تصور دیوار میکشه. در نتیجه لازمه تصورات و فانتزی هات رو همه جا بذاری.',
                'محیط مثل یه دست نامرئی رفتار ما رو شکل میده. صرف نظر از منحصر به فرد بودن شخصیت هر کسی، رفتارهای معینی تحت شرایط محیطی خاص دائما از سمت افراد تکرار میشن. ',
                'توی فضاهای عمومی ساکت آدمها آروم حرف میزنن، توی خیابون تاریک آدمها محتاط رفتار میکنن. شایعترین فرم تغییر جنبه ی درونی نداره... بلکه از بیرون رخ میده ما براساس دنیای پیرامونمون عوض میشیم.',
                'متاسفانه محیط های کار و زندگی ما به خاطر نبود نشونه و یادآور واضح برای فعال کردن رفتارها باعث میشن انجامشون ندیم. زمانی که میوه رو توی یخچال نبینی خیلی راحت یادت میره مصرفش کنی، تشک یوگا وقتی ته انباری باشه فراموش میشه.',
                'زمانی که نشونه های فعال کننده عادات در چشم نباشن نادیده گرفته میشن. پس باید با استفاده از روش های طراحی محیط شفافیت و وضوح نشونه های عادات جدید رو افزایش بدی.',
                'اگه میخوای یادت بمونه قبل حمام بشین پاشو بری یه کاغذ روی در حمام بچسبون، اگه میخوای یادت بمونه بعد از خالی شدن نصف بطری آب پرش کنی یه خط با ماژیک وسط بطری بکش...',
                'اگه میخوای یادت بمونه ساعت 7 توی دفترچه خاطراتت یه چیزی بنویسی دفترت رو روی میز صبحانه بذار، اگه میخوای وقتی حوصله سر رفت جای گوشی کتاب دستت بگیری عکس کتابی که میخونی رو روی صفحه قفل بذار...',
                'اگه میخوای یادت بمونه هر روز صبح بدوی شب قبل لباس و کفشت رو آماده کن، اگه میخوای یادت بمونه زبان اسپانیایی تمرین کنی فلش کارتهات رو روی میز ناهارت بذار...',
                'با تغییر فضای زندگی و کارت میتونی خودت رو در معرض نشونه های مثبت قرار بدی با دیدن نشونه ها گرفتن تصمیم درست خیلی راحتتر و حتی به صورت طبیعی انجام میشه.',
                'در نهایت توی تکالیف امروز یه جدول می‌بینی و که توش یادآور هایی که لازم هسـت تعبیه بشـن رو لیسـت کردیم و لازمـه کـه حـداقـل ۵ تـای اونهـا رو تهیـه کنی؛ (می‌تونی یادآور های مورد نظر خودت رو هم بنویسی)',
            ];
        } elseif ($number == 9) {
            return [
                'امروز قراره موانعی که تا الان متوجه شون شدی رو  حذف و کار رو آسونتر کنیم. اما ابتدا یه توضیح کوتاه:',
                'انرژی ارزشمنده و مغز تنظیم شده تا حفظش کنه ذات انسان از قانون کمترین تلاش پیروی میکنه، قانونی که میگه بین دوتا گزینه انتخاب اونی هست که کار کمتری داره مثلا بین گسترش مزرعه به سمت اقلیم مشابه با سمتی که اقلیم متفاوته قطعا انتخاب گزینه اوله؛ ',
                'بین همه ی انتخاب ها، انتخابی پسندیده میشه که بیشترین ارزش رو با کمترین تلاش تحویل بده. هر قدر انرژی بیشتری برای شروع یه اقدام لازم باشه احتمال رخ دادنش کمتره. اگه هدفت روزی 100تا دراز نشسته انرژی زیادی لازم داری؛ ',
                'ابتدا که هیجان زده ای میتونی قدرت لازم رو جمع کنی اما پس از چند روز این تلاش زیاد خسته ت میکنه در حالی که روزی یه دراز نشست انرژی خاصی نیاز نداره و هر عادتی که انرژی کمتری بخواد به وقوع نزدیکتره',
                'به هر رفتاری که بخش زیادی از زندگیت رو اشغال میکنه نگاه کن متوجه میشی برای اجراش انرژی زیادی نیاز نداری. ور رفتن با گوشی، بررسی ایمیل، تماشا تلویزیون بیشتر وقت ما رو میگیرن چون انجامشون به شدت راحته.',
                'قطعا ما توانایی انجام کارهای سخت رو هم داریم، مشکل حس و حال ماست که بعضی روزها میتونیم و بعضی روزها دوست داریم تسلیم شیم. در روزهای سخت باید مسائل رو به نفع خودمون رقم بزنیم…',
                'هر قدر اصطکاک کمتری احساس کنیم شخصیت قدرتمند درونمون ساده تر بروز میکنه، ایده ی (ساده کردن) به معنی انجام کارهای ساده نیست یعنی امری که در درازمدت سوددهی داره رو حتی المکان ساده کنیم.',
                'فرض کن یه شلنگ باغبونی داری که از وسط خم شده و فشار آب رو کم کرده دو راه وجود داره یا میتونی شیر آب رو بیشتر باز کنی یا خمیدگی رو از بین ببری، تلاش برای افزایش انگیزه و پایبندی به یه عادت سخت مثل باز کردن بیشتر شیر هست...',
                ' در صورتی که خیلی راحت با ساده کردن عادات مثل از بین بردن خمیدگی شلنگ میتونی به جای غلبه، از میزان اصطکاک های زندگی کم کنی.',
                'اغلب سعی میکنیم عادات رو توی محیط هایی که اصطکاک بالایی دارن شروع کنیم مثلا سعی میکنیم رژیممون رو حفظ کنیم وقتی که با دوستانمون برای شام بیرون رفتیم، سعی میکنیم توی یه خونه شلوغ کتاب بنویسیم...',
                'یا روی کارمون تمرکز کنیم وقتی گوشی هوشمند پر از حواس پرتیمون دستمونه، این کار درست نیست باید نقاط تنش زایی که مانعمون هستن رو از پیش رو برداریم.',
            ];
        } elseif ($number == 10) {
            return [
                'داشتن انتخاب های زیاد همیشه چیز خوبی نیست و میتونه ذهنمون رو خسته و گمراه کنه. فرض کن میخوای کالای خاصی رو از دیجیکالا بخری مواجه شدنت با تعداد فروشنده ها و تنوع محصولات زیاد باعث تاخیر توی خریدت میشه.',
                'یا قصد خرید یه فرش مشکی رو داری تصور کن وقتی وارد فروشگاه میشی فروشنده بهت بگه 3 مورد فرش مشکی موجود داره یا بهت بگه 1000 تا فرش مشکی هست که میتونی ببینی توی مورد او ل در عرض 10 دقیقه انتخابت رو میکنی ولی توی مورد دوم تا وقتی هر 1000 تا فرش رو نبینی مطمئن نیستی که بهترین انتخاب رو کردی.',
                'این اواخر وبسایت آمازون سعی کرده با استفاده از هوش مصنوعی فقط بهترین انتخاب ها از نظر محصول، قیمت و فروشنده رو به ما نشون بده دلیل این اتفاق چیزیه که آمازون سال 2015 با بیشترین تعداد فروشنده و محصول در جهان متوجه شد',
                'در اون سال بر خلاف افزایش تعداد فروشنده ها و محصولات سفارشات کاهش داشتن بعد از بررسی متوجه شدن یه کالا مدت طولانی توی سبد خرید می مونه در حالی که کاربر داره بقیه موارد رو بالا پایین میکنه و آخرش هم سفارشش رو ثبت نمیکنه.',
                'امروز میخوایم انتخاب های زیاد برای اجرای عادت جدیدمون رو محدود کنیم',
                'میخوایم جلوی ذهنمون فقط یه راه بذاریم و بگیم همینه که هست! باید سعی کنیم مواردی رو شناساییی کنیم که ذهنمون رو از مسیر اصلی دور میکنن و باعث میشن بیش از حد به نحوه اجرای عادت فکر کنیم',
                'اصلا عاقلانه نیست که بخوای همه ی روش ها رو امتحان کنی این میتونه وقتی عادتت شکل گرفت اتفاق بیفته نه ابتدای مسیر.',
                'مثلا برای عادت باشگاه رفتن یه برنامه ساده و قابل اجرا انتخاب کن و از این که  هر روز بخوای دستگاه ها و روش های جدید رو امتحان کنی پرهیز کن. یه برنامه مشخص داشته باش؛ بعد از شکلگیری عادتت میتونی برنامه کاملتری انتخاب کنی.',
                'یا برای عادت کتاب خوندن، خیلی مهمه اولین کتابت تو رو به کتاب خوندن علاقمند کنه اما وقتی انتخابش کردی به هیچ وجه تغییرش نده! تا شکلگیری عادت با یه کتاب مشخص و یه ژانر مشخص پیش برو.',
            ];
        } elseif ($number == 11) {
            return [
                'یه رفتار وقتی به صورت خودکار انجام بشه نیازی به تفکر قبل از انجام نداره و وقتی یه کار رو بارها انجام دادیم بهش سرسری نگاه میکنیم و فرض میکنیم دفعه بعد هم مثل دفعه آخر انجام میشه.',
                'ما به کارهای همیشگیمون عادت میکنیم و دیگه از خودمون نمیپرسیم اصلا کارهای درستی هستن یا نه. خیلی از کمبودهای عملکردهای ما رو میشه به نبود خودآگاهی نسبت داد.',
                'یکی از بزرگترین چالش های تغییر عادت، حفظ آگاهی نسبت به کارهایی ست که واقعا در حال انجامش هستیم. ما به یک سیستم (اشاره و فراخوان) برای زندگی شخصیمون نیاز داریم.',
                'سر منشا کارت امتیازی عادت ها همینه، یه رویه ساده که می تونی از اون برای کسب آگاهی بیشتر نسبت به رفتارت استفاده کنی. برای اینکه کارت امتیازی خودت رو بسازی، فهرستی از عادت های روزمره ت تشکیل بده.',
                '
این یه نمونه ست که می تونه شروع فهرستت رو نشون بده:
بیدار شدن
خاموش کردن آلارم
بررسی گوشی
رفتن به دستشویی
وزن کردن خودم
گرفتن دوش
مسواک زدن دندان ها
زدن عطر
لباس پوشیدن
درست کردن یه فنجون چای
و...',
                'بعد از ساخت فهرست به هر رفتار نگاه کن و از خودت بپرس (این یه عادت خوبه یا بد یا خنثی؟)
اگه عادت خوبه یه (+) اگه عادت بده (-) و اگه خنثی ست یه (=) کنارش بذار.',
                'ابتدای ساخت کارت امتیازی عاداتت نیازی به ایجاد تغییرات نیست. صرفا هدف اینه که بفهمیم چه اتفاقاتی رخ میده. افکار و اقداماتت رو بدون قضاوت ببین نه خودت رو سرزنش کن نه تشویق اولین گام برای تغییر عادات بد، پیدا کردنشونه.',
                'اقدام و نتیجه ی احتمالیش رو با صدای بلند بگو. اگه میخوای عادت مصرف فست فود رو کاهش بدی اما داری کلوچه برمیداری با صدای بلند بگو قراره این کلوچه رو بخورم اما بهش نیازی ندارم خوردنش باعث اضافه وزن و آسیب به سلامتیم میشه.',
            ];
        } elseif ($number == 12) {
            return [
                '
شخصیت جدیدت رو جار بزن
توی بخش مکمل روز اول پلنر برنامه یه چیز مهم یاد گرفتیم نقش هویت و شخصیت توی شکلگیری عادت هامون، اگه بتونیم زودتر شخصیت مورد نیاز عادت جدیدمون رو بسازیم کارمون خیلی راحتتر میشه و امروز قراره یه کار عجیب انجام بدیم!
',
                '
برو توی تموم گروه هایی که عضویی بنویس داری چجور آدمی میشی!
هر جایی که رفتی، پیش خونواده یا دوستانت بهشون بگو که چه اتفاقی داره میوفته!
توی اینستاگرامت یه پست بذار و از شخصیت هایی که عادت تورو دارن تعریف کن!
یا از بخش پروفایل همین برنامه استفاده کن و خصوصیات جدیدت رو به اشتراک بذار!',
                'مثلا برای عادت ورزش برو توی گروه دوستانت و بگو که داری خیلی به سلامتیت اهمیت میدی و اینکه بدنت روی فرم باشه جزو اولویت هاته، این رو به همه بگو و هر چقدر می تونی تکرارش کن.',
            ];
        } elseif ($number == 13) {
            return [
                'تا اینجای کار حتما خیلی سعی کردی با اراده و زور عادتت رو تکرار کنی. توی این درس میخوایم ببینیم خویشتن داری و کنترل شخصی تا کجا کمک کننده ست، و چقدر انرژی نیاز داره و جایگزینش چیه؟',
                'وقتی یه عادت کدگذاری بشه بعد از دیدن سرنخ های محیطی مربوط بهش برای انجامش وسوسه میشی. این یکی از دلایلی هستش که تکنیک های تغییر رفتار میتونن پیامدهای منفی داشته باشن.',
                'وقتی کلیپ های مربوط به تکنیک های کاهش وزن رو به افراد چاق نشون میدی باعث فشار روانی و خجالت زدگیشون میشه و نتیجه همون استراتژی محبوبشون یعنی خوردن بیش از حده.',
                'نمایش تصویر ریه های تیره به افراد سیگاری، باعث افزایش اضطراب میشه و خیلی ها رو به سمت سیگار میکشه. اگه به سرنخ ها دقت نکنی، ممکنه همون رفتاری که میخوای حذف کنی رو بیشتر تحریک کنی...',
                'محقق ها به این پدیده میگن (خواسته های القا شده بر اثر سرنخ) یه محرک بیرونی که باعث ایجاد حس اضطراب برای تکرار به عادت بد میشه. اگه تصویر کوکائین رو فقط 33 ثانیه به کسی که بهش اعتیاد داره نشون بدن، سامانه پاداش مغزش فعال میشه.',
                'خویشتن داری، یه استراتژی کوتاه مدته، نه راه حل بلند مدت. شاید بشه یک یا دو بار جلوی وسوسه رو گرفت اما احتمالش کمه اراده لازم برای هر بار نادیده گرفتن تمایلات رو داشته باشیم. بهتره انرژیمون رو صرف بهینه سازی محیطمون بکنیم.',
                'در نتیجه، سرنخ های مربوط به عادات خوب رو معرض دید بذار و سرنخ عادت های بد رو مخفی کن.',
            ];
        } elseif ($number == 14) {
            return [
                'در این درس راجع به یکی از قدرتمندترین محرک های تغییر رفتار و عادت صحبت میکنیم؛ محیط اجتماعی... ما عادات ابتداییمون رو انتخاب نمیکنیم بلکه تقلیدشون میکنیم.',
                'ما همون سناریویی رو دنبال میکنیم که خونواده، دوستان، مدرسه، مکان های مذهبی، جامعه ی محلی و جوامع بزرگترمون به ما دادن. هر کدوم ازین عوامل مجموعه انتظارات و استانداردهای خوشون رو دارن؛',
                'درباره ی ازدواج کردن یا نکردن، تعداد فرزندان، تعطیلاتی که باید جشن گرفت و ...',
                'این هنجارهای اجتماعی مثل قوانین نامرئی هستن که هر روز رفتار ما رو هدایت می کنن، اغلب بدون تامل و یادآوری از عادت های فرهنگمون پیروی میکنیم. همونطور که پروفسور فرانسوی، میشل دومونتین می نویسه (رسوم و رویه های زندگی در جامعه، ما رو با خود همراه میکنن)',
                'ما عادت های اطرافیانمون رو بر می داریم. روشی که والدینمون برای کنترل مباحث دارن، طوری که دوستانمون با دیگری خوش و بش میکنن و راهی که همکارانمون برای کسب نتیجه دارن رو کپی میکنیم.',
                'وقتی دوستت علف میزنه، تو هم امتحان میکنی، وقتی همسرت عادت داره قبل خواب دو بار قفل بودن در رو چک کنه تو هم همین کار رو میکنی! یکی از موثرترین کارها برای ایجاد عادات بهتر پیوستن به فرهنگی ست که رفتار مطلوبت رفتار معمول اونهاست.',
                'اگه دورت پر از افراد با اندام متناسب باشه، احتمال اینکه ورزش عادت معمولت بشه بیشتره. اگه با عاشقان موسیقی جاز بگردی، احتمال اینکه هر روز موسیقی جاز زدن برات منطقی باشه بیشتره.',
                'هر زمان که ندونیم چیکار کنیم به گروه نگاه میکنیم تا راهنمای رفتارمون باشن. ما دائما در حال اسکن کردن محیط هستیم و از خودمون می پرسیم (بقیه چیکار می کنن؟) نظرات دیجیکالا رو بررسی می کنیم، چون دوست داریم از بهترین عادت های خرید، خوراک و مسافرت تقلید کنیم.',
                'گام مهم اینه عضوی گروهی بشی که رفتار مطلوب تو رفتاری عادی اونهاست.',
                'کسی رو پیدا کن که عادتت رو داره، امروز قراره ازت بخوایم کسی رو پیدا کنی که عادت انتخابیت رو توی خودش داره (مهم نیست به چه شکلی! چه اون عادت رو ساخته باشه چه الگوش گرفته باشه)',
                'بعد از اینکه همچین کسی رو توی اطرافیانت پیدا کردی باید باهاش تماس بگیری و یا بری ملاقاتش، لازمه تا جایی که می تونی راجع به اون عادت، پیامدهاش، شخصیتی که باعثش شده و... با اون شخص صحبت کنی.',
                'چیزی که امروز ازت میخوایم انجام شدنش خیلی خیلی خیلی مهمه! لطفا به خاطر زحمتی که تا الان کشیدی و چیزایی که میخوای بهشون برسی حتما انجامش بده.',
            ];
        } elseif ($number == 15) {
            return [
                'هر بار که ما تصمیم بگیریم یه چیزی رو از روتین زندگیمون حذف یا به اون اضافه کنیم غریزه خطر فعال میشه و سعی میکنه قبل از شکلگیری مسیری نورونی جدید ما رو از تکرار اون رفتار جدید منصرف کنه!',
                'و اینجاست که یکی از قویترین حقه هاش رو رو میکنه! بهت میگه جور دیگه ای یا زمانی دیگه ای هم میشه انجامش داد.',
                'و با اینکار قطعیتی که ساختی رو از بین میبره و دیگه عادت جدیدت نمی تونه یه جای خاص برای زندگی داشته باشه. راه مقابله باهاش اینه که بشینی و بنویسی ذهنت دقیقا چی داره بهت میگه...',
                'دقیقا مشخص کن چه بهونه هایی توی ذهنته و روشون کار کن، اگه میتونی باهاشون کنار بیا، اگه میتونی به خودت قول بده که دیگه بهشون فکر نمی کنی، اگه میتونی باهاشون توافق کن! به این معنی که سعی کن تا جایی که به عادت جدیدت آسیب وارد نمیکنن انجامشون بدی.',
                'نوشتن دقیق حرفای ذهنت و مشخص کردن اونها مهمترین بخش درس امروزه.',
            ];
        } elseif ($number == 16) {
            return [
                '
خیلی ساده امکان داره توی مسیر تلاش برای ساختن برنامه ی بهینه تغییر گرفتار بشیم:
سریعترین راه کاهش وزن، بهترین برنامه عضله سازی، اونقدر درگیر بهترین روش ها میشیم که هیچوقت قدم برنمیداریم!
',
                '
(بهتر بودن، دشمن وضعیت فعلی ست)
حرکت کردن و عمل کردن به نظر مشابه هستن اما یکسان نیستن.
وقتی در حرکتی در حال طرح ریزی و استراتژی سازی و یادگیری هستی اما به نتیجه ختم نمیشن',
                'حرکت مفیده اما هیچوقت به تنهایی نتیجه ای نمیده. مهم نیست چند بار با یه مربی خصوصی صحبت کنی چون حرکت بدنت رو ورزیده نمیکنه. تنها اقدام به ورزشه که نتیجه میده.',
                '
اگه حرکت به نتیجه ختم نمیشه پس چرا این کار رو انجام میدیم؟
گاهی به خاطر نیاز به برنامه یا آموزش بیشتره اما اغلب به این خاطر سراغ حرکت میریم که حس پیشروی رو برای ما ایجاد میکنه، بدون اینکه با خطر شکست مواجه بشیم',
                'اگه میخوای به یه عادت مسلط بشی، نکته کلیدی تکرار و تکرار اون عادته، نه اینکه دنبال ایده آل باشی',
            ];
        } elseif ($number == 17) {
            return [
                'چگونه پاداشی رو به وجود بیاریم که باعث بشه عاداتمون رضایت بخش باشه',
                'مهمترین بخش موندگار کردن عادت حس موفقیته، حتی کم و جزئی. حس موفقیت سیگنالیه که به مغز میگه داره نتیجه میده و ارزشش رو داره.',
                'پاداش یه جنبه ی کلیدی از تشکیل عادته. حس همراه با پاداش (لذت، رضایت، شادی) باعث بسته شدن حلقه بازخورد میشه و به مغز یاد میده کدوم رفتارها رو برای دفعه بعد به خاطر داشته باشه.',
                'امروز راه های بستن حلقه بازخورد عادات رو به شیوه مثبت و لذتبخش یاد میگیریم؛ این که چجوری پاداش موثری به وجود بیاریم و عادات رو لذتبخش کنیم.',
                'مهندسان شهر استکهلم سوئد مجموعه ای از حسگرها به شکل کلیدهای پیانو رو روی چند راه پله توی مترو قرار دادن، مردم روی اونها راه میرفتن نت های موسیقی نواخته میشد.',
                'مردم ازین کار لذت میبردن به همین خاطر افرادی که برای خروج از پله ها استفاده میکردن 66 درصد افزایش داشت، هر چقدر عادتی سریعتر باعث حس رضایت بشه احتمال تکرار شدنش بیشتره.',
                'کاری که پاداش میگیره، تکرار میشه و از کاری که با تنبیه همراهه پرهیز میشه…',
                'فداکاری حرف اول رو میزنه، چند باری که تا الان عادتت رو تکرار کردی نتیجه زیادی ازش نگرفتی یا محسوس نبوده. مثلا چند باری که عادت ورزش رو تکرار کردی نه قویتر شدی نه وزن زیادی کم کردی.',
                'باید ادامه بدی تا بلاخره نتایج رو ببینی وزن کم کنی، شکل بازوهات تغییر کنه و...',
                'پس اول کار نیاز به یه پاداش آنی داری که ذوقت رو برای تکرار اون عادت در حالی که نتایج داره توی پس زمینه جمع میشه حفظ کنه.',
                'پایان اجرای عادت تجربه خیلی مهمیه چون این مرحله بیشتر از مراحل دیگه پروسه توی ذهنمون میمونه، پس برای اجرای عادتت یه پاداش نیاز داری و نکته مهم اینجاست که پاداش انتخابیت با هویت که داری شکل میدی همخونی داشته باشه.',
                'برای خودت یه تقویت کننده خارچی ایجاد کن که با هویت مطلوبت مطابقت داره.',
                'توی یه دنیای بی نقص پاداش یه عادت خوب همون عادت خوبه اما توی دنیای واقعی عادات خوب فقط وقتی ارزشمند به نظر میان که نتیجه قابل لمس داشته باشن. تشویق آغازگر و هویت محافظ یه عادته.',
                'به وجود اومدن یه هویت جدید زمانبره، با تشویق آنی میتونیم انگیزه رو در کوتاه مدت حفظ کنیم و در عین حال منتظر پاداش های بلندمدت باشیم.',
            ];
        } elseif ($number == 18) {
            return [
                'روزهای های قبل، ما درباره طراحی محیط صحبت کردیم تا به کمک این روش نشونه ها واضحتر بشن، اما تو میتونی با بهینه کردن محیطت کاری کنی که خود کارها راحتتر انجام بشن!',
                'اسم این فرایند کاهش اصطکاکه، هر چقدر اصطکاک مربوط به یه عادت کمتر باشه احتمال رخدادش بیشتره یعنی هر چی راحتی بیشتر باشه احتمال دنبال کردن عادت توسط تو هم بیشتر میشه.',
                'بهترین جا که میتونی عادت جدیدت رو تمرین کنی جایی در مسیر روتین روزانه ت هستش، اگه عاداتت در مسیر جریان زندگیت باشن شاختنشون راحتتره.',
                'مثلا رفتن به باشگاهی که در مسیر محل کارته اصطکاک زیادی به وجود نمیاره ولی باشگاهی که فقط چند محله اونورتره تو رو از مسیر اصلیت خارج میکنه.',
                'راه حل موثرتر کاهش اصطکاک توی خونه یا دفتر کاره. مثلا سالم خوری توی خونه ای که پر از چیپس و کلوچه ست یا یه گفتگوی خوب وقتی اعلان ها هر لحظه مکالمه رو قطع میکنن ممکن نیست.',
                'این تلاش ها برای تشکیل عادت مثل آبی هست که به زور میخواد از شلنگ خم شده عبور کنه به جای بیشتر باز کردن شیر آب و کلنجار رفتن با اصطحکاکات محیط کافیه خم شلنگ رو باز کنی.',
                'ایده اصلی اینه که محیطی رو ایجاد کنی که انجام کار صحیح در اون به راحتترین حالت ممکن باشه',
                'مثلا:
اپلیکیشن های یادگیری و مدیتیشن رو در صفحه اصلی گوشیت بذار به جای اپلیکیشن هایی مثل ایسنتاگرام یا شبکه های اجتماعی که حواست رو پرت میکنن.',
                'یه باشگاه خونگی درست کن اینجوری اگه وقتت کم هم باشه بتونی چندتا از حرکات رو تمرین کنی. (مثل نسخه دو دقیقه ای عادتت که روزهای قبل روش کار کردیم)',
                'بهترین راه برای کاهش اصطکاک استفاده از فناوری و اتوماسیونه. این دقیقا کاریه اکثر کسب و کارها میکنن، اگه به محصولاتی که عاداتمون رو شکل میدن نگاه کنی میبینی که سعی میکنن اصطکاک زندگی رو کم کنن…',
                'خرید اینترنتی اصطکاک رفتن به سوپر مارکت، اپلیکیشن دوستیابی اصطکاک آشنا شدن های حضوری، سرویس های اشتراک وسیله نقلیه اصطکاک عبور و مرور در شهر و سرویس های پیامک اصطکاک ارسال نامه رو کاهش میدن.',
                'همینطور که کسب و کارها  برای خودکارسازی رفتار انبوه مردم از فناوری استفاده میکنن،  تو هم میتونی برای خودکارسازی رفتارت ازشون استفاده کنی…',
                'مثلا ما یه مخلوط کن جدید خریدیم که اسموتی رو با فشار یه دکمه درست میکنه و تمیز کردنش هم خیلی آسونه، مدل های جدیدتری هم هستن که خودشون رو تمیز میکنن. فناوری میتونه اعمالی که زمانی آزاردهنده و پیچیده بودن رو به رفتارهای آسون و بی دردسر تبدیل کنه.',
            ];
        } elseif ($number == 19) {
            return [
                'عادت ها مثل پیچ ورود به بزرگراه هستن، تو رو به سمت جاده هدایت میکنن و با سرعت به سمت رفتار بعدی میری! ادامه دادن کارهایی که قبلتر انجام میدادی راحتتر از شروع کارهای متفاوته…',
                'دو ساعت پای یه فیلم بد بشینی، با معده پر به خوردن میان وعده ادامه میدی یا قراره گوشیت رو فقط یه ثانیه چک کنی اما بیست دقیقه آینده رو به صفحه نمایش زل زدی…',
                'به همین دلیل عادت هایی که بدون فکر انجام میدی تعیین کننده انتخاب های فکر شده ت هستن.',
                'هر روز لحظاتی وجود داره که تاثیر قابل توجه ای دارن که بهشون (لحظات تعیین کننده) میگیم؛',
                'لحظه ای که بین غذا بیرون و خونه تصمیم میگیری، لحظه ای که بین رانندگی با ماشین یا دوچرخه تصمیم میگیری، لحظه ای که بین انجام تکالیف و بازی تصمیم میگیری، این انتخاب ها مثل یه دو راهی هستن!',
                'تفاوت بین یه روز خوب و یه روز بد فقط گرفتن چندتا تصمیم مفید و سالم در لحظه های تعیین کننده ست. مجموع این انتخاب ها طی مسیر خروجی متفاوتی برامون میسازه',
                'عادت ها مسیر نهایی رو مشخص میکنن پس تسلط بر لحظه های تعیین کننده ی طول روز اهمیت زیادی داره،  انتخاب های کوچیکت روی هم جمع میشن و نحوه یپیشرفتت در بازه ی زمانی بعدی رو تعیین میکنن!',
            ];
        } elseif ($number == 20) {
            return [
                'احتمالا تا اینجای کار از یه سری بخش های عادتت زده شدی و بعضی یادآورهای روز هشتم تاثیرشون رو از دست دادن.',
                'ساختن عادات جدید دو عنصر خیلی مهم داره، اول اینکه سریعا بخش هایی از عادت جدید که متنفرت میکنن رو شناسایی کنی و اقدامات لازم رو انجام بدی و دوم اینکه همیشه یادآور هات تاثیرگذار باشن.',
                'امروز بررسی کن ببین چه بخش هایی از  عادتت داره خسته ت میکنه، اگه لازمه اون بخش رو تغییر بده یا حذفش کن یا اگه میتونی ذهنیتت رو راجع بهش عوض کن و ببین کدوم یادآور هایی که تهیه کردی تاثیر ندارن همین امروز جایگزینشون کن.',
                'این روند رو بعد از این 21 روز هم ادامه بده و همیشه مراقب این دو عنصر حیاتی باش. از عادتت متنفر نشو، یادآورهات رو آپدیت کن.',
                'درنهایت امروز ازت می‌خوایم یادآور هایی که توی روز هشتم برای خودت ساختی رو ویرایش کنی و از تنوع غافل نشی.',
            ];
        } elseif ($number == 21) {
            return [
                'مغز ما چالش رو دوست داره اما چالشی که دشواری بهینه و معقولی داشته باشه. اگه قرار باشه با یه بچه چهار ساله یه مسابقه ی جدی بدی حوصلت سر میره این مسابقه خیلی آسونه،',
                'اگه با یه تنیسور حرفه ای هم بازی کنی باز حوصلت سر میره چون این مسابقه خیلی سخته.',
                'حالا تصور کن با یه نفر هم تراز خودت بازی کنی، طی بازی چند امتیاز تو و چندتا حریف میگیره.   ',
                'اگه تلاش کنی برای پیروزی شانس خوبی داری، تمرکز میکنی، سایر مسائل از ذهنت پاک میشه و خودت رو وقف وظیفت میکنی. این یه چالش با میزان دشواری قابل مدیریته یه نمونه عالی از قانون طلایی.',
                'قانون طلایی میگه انسان بیشترین انگیزه رو زمان تجربه وظایف متناسب با توانمندیش داره.',
                'برای پایبند موندن به یه عادت باید رفتارمون حتی در شرایط غیر ایده آل در آسونترین حد ممکن باشه.',
                'اما وقتی عادت جا افتاد باید پیشرفت رو با گام های کوچک ادامه بدیم همین بهبودهای کوچک و چالش های جدید ما رو دلگرم میکنه و اگه بتونیم درست در منطقه طلایی قرار بگیریم میتونیم به شرایطی برسیم که تمرکزمون فقط روی هدف باشه.',
            ];
        }
    }

    private function seedExercise($number)
    {
        if ($number == 1) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'پیش نیاز های عادت جدیدم',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            /////////////////
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'شخصیت الگوی من این اخلاقیت رو داره',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 2) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'کارایی که من رو از
پروسه متنفر می‌کنن؛',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            ///
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'جایگزین اون کارها
(اگه دارن  اینجا بنویس)',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 3) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'من میخوام بعد از نتیجه گرفتن از
عادت (فلان) این کار ها رو انجام بدم
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            //
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'انتظاراتم از خودم برای فردا؛',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 4) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'اقداماتی که می‌تونم برای تنظیم
روتین خوابم انجام بدم',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            //
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'چیزی که لازمه امروز
به خودم یادآوری کنم؛
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 5) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'نسخه ۲ دقیقه و ساده شده عادتم: ',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'بهونه هایی که تا اینجای کار
ذهنم جلوی راهم گذاشته؛
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 6) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['fill-in-the-blank'])
                        ->first()->id,
                    'question' => json_encode([
                        'phrase' => 'من در [_] (زمان) در [-] (مکان)
[_] (رفتار) رو انجام خواهم داد',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 7) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['fill-in-the-blank'])
                        ->first()->id,
                    'question' => json_encode([
                        'phrase' => 'من فقط وقتی [_] (عادت و رفتار مورد علاقه) که [_] (عادتی که سعی در ایجادش را دارید) رو انجام بدم.',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 8) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES[ 'checkbox-list' ])
                        ->first()->id ,
                    'question' => json_encode([
                        [ 'li' => 'تهیه یک المان خاص' ] ,
                        [ 'li' => 'چسبوندن استیکر یادآور' ],
                        [ 'li' => 'درخواست یادآوری از یک دوست' ],
                        [ 'li' => 'درخواست یادآوری از یک دوست' ],
                        [ 'li' => 'تصویر یادآور روی صفحه لپ تاپ' ],
                        [ 'li' => 'متن یادآور روی صفحه گوشی' ],
                        [ 'li' => 'متن یادآور روی صفحه گوشی' ],
                        [ 'li' => 'تابلو متن یادآور به دیوار' ],
                    ]) ,
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number ,
                    'exercise_id' => $exercise->id ,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'اقدامات لازم برای تهیه
 یادآورهای مورد نیاز؛
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 9) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'شناسایی سوژه هایی که
اصطکاک اجرای عادتم رو بالا میبرن
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'جمله ای که امروز بهش نیاز دارم؛ ',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 10) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'شناسایی آپشن های زیادی؛',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'اقدامات لازم برای محدود کردن اونها؛',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 11) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'عادت هایی که من رو از
مسیر دور میکنن؛
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'آیا حس میکنم عادتم داره
شکل میگیره؟
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 12) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'اقداماتی که میتونم برای جار زدن
هویتم انجام بدم؛',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'یادآور شخصیتی که برای خودم
می‌پسندم؛ من آدمی هستم که…
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 13) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'سرنخ های تکرار عادات بد من و رفتار هایی که عادت انتخابیم رو تحت تاثیر قرار میدن اینها هستن… ',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'یادآور شخصیتی که برای خودم
می‌پسندم؛ من آدمی هستم که…
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 14) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES[ 'checkbox-list' ])
                        ->first()->id ,
                    'question' => json_encode([
                        [ 'li' => 'شناسایی پیج هایی که توی اینستاگرام به پیشرفت عادت مطلوب من کمک میکنن.' ] ,
                        [ 'li' => 'شناسایی پادکست هایی که به پیشرفت عادت مورد نظر من کمک میکنن.' ],
                        [ 'li' => 'شناسایی گروه های نزدیک به من که به پیشرفت عادت مورد نظر من کمک میکنن.' ],
                        [ 'li' => 'شناسایی گروه هایی که مانع و خلاف رفتار مورد نظر من هستن.' ],
                    ]) ,
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number ,
                    'exercise_id' => $exercise->id ,
                ]);

            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'چه کسی عادت من رو داره؟ و
چجوری می‌تونم باهاش ارتباط بگیرم؟',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 15) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'بهونه هایی که تا اینجای کار
توی ذهنم رشد کردن؟
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'چجوری میتونم حلشون کنم؟
میتونم جذابشون کنم؟ لازم هست ذهنیتم
رو نسبت به چیزی تغییر بدم؟
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 16) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'جنبش های من برای تغییر عاداتم',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'اعمال من برای تغییر عاداتم…',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 17) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'خرده اعمالی که تکرار رفتار مورد نظرم
رو محتمل تر میکنن…
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'چقدر دوست دارم این عادت جدید
توی سبک زندگیم جا بگیره؟
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 18) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'موانعی که احتمال تکرار رفتار
مورد نظرم رو کم میکنن…
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'طبق برنامه روز چهاردهم چقدر با کسی که عادت من رو داره ارتباط گرفتم؛',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 19) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'این رفتار های کوچیک من رو به
سمت عادت مورد نظرم میبرن؛
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['ordered-list'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'این رفتار های کوچیک من رو از
عادت مورد نظرم دور میکنن؛
',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 20) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES[ 'checkbox-list' ])
                        ->first()->id ,
                    'question' => json_encode([
                        [ 'li' => 'تهیه یک المان خاص' ] ,
                        [ 'li' => 'چسبوندن استیکر یادآور' ],
                        [ 'li' => 'درخواست یادآوری از یک دوست' ],
                        [ 'li' => 'تصویر یادآور روی صفحه لپ تاپ' ],
                        [ 'li' => 'متن یادآور روی صفحه گوشی' ],
                        [ 'li' => 'تابلو متن یادآور به دیوار' ],
                    ]) ,
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number ,
                    'exercise_id' => $exercise->id ,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'آیا لازمه تغییر دیگه ای هم توی روند شکل گرفتن عادت جدیدم ایجاد کنم؟',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        } elseif ($number == 21) {
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'طبق درس امروز این پایین بنویس چه حدی از عادتت تو رو از مسیر زده میکنه و چه حدیش باعث میشه حوصله ت سر بره و در ادامه هم همیشه این سوال رو از خودت بپرس: ',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
            $exercise = Exercise::query()
                ->create([
                    'exercise_type_id' => ExerciseType::name(ExerciseType::NAMES['textarea'])
                        ->first()->id,
                    'question' => json_encode([
                        'title' => 'جمله ای که برای ادامه مسیر
می‌تونه کمکم کنه',
                    ]),
                ]);
            DayExercise::query()
                ->create([
                    'day_id' => $number,
                    'exercise_id' => $exercise->id,
                ]);
        }
    }
}
